{
    "activation_function": "gelu_new",
    "architectures": [
      "GPT2LMHeadModel"
    ],
    "attn_pdrop": 0.1,
    "bos_token_id": 20,
    "embd_pdrop": 0.1,
    "eos_token_id": 20,
    "gradient_checkpointing": false,
    "initializer_range": 0.02,
    "layer_norm_epsilon": 1e-05,
    "model_type": "gpt2",
    "n_ctx": 100,
    "n_embd": 20,
    "n_head": 4,
    "n_inner": null,
    "n_layer": 3,
    "n_positions": 100,
    "resid_pdrop": 0.1,
    "summary_activation": null,
    "summary_first_dropout": 0.1,
    "summary_proj_to_labels": true,
    "summary_type": "cls_index",
    "summary_use_proj": true,
    "vocab_size": 21
  }
